---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimNotModifiable
source: html/91e551e9-a844-1920-a18f-ed64dc38839d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimNotModifiable Property

"Non-modifiable"

## Syntax (C#)
```csharp
public static ForgeTypeId DimNotModifiable { get; }
```